tutorials/combustion/XiFoam/les/pitzDaily3D/0/muSgs
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2.0.0                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    "0";
    object      muSgs;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [ 1 -1 -1 0 0 0 0 ];

internalField   uniform 0;

boundaryField
{
    inlet
    {
        type            zeroGradient;
    }
    outlet
    {
        type            zeroGradient;
    }
    upperWall
    {
        type            muSgsUSpaldingWallFunction;
        value           uniform 0;
    }
    lowerWall
    {
        type            muSgsUSpaldingWallFunction;
        value           uniform 0;
    }
    front
    {
        type            cyclic;
    }
    back
    {
        type            cyclic;
    }
}


// ************************************************************************* //
